src/cfe/КСП/Catalogs/КоллекцииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КоллекцииНоменклатуры</Name>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КСП_РежимРасчетаКурсовогоКоэффициента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КСП_РежимыРасчетаКурсовогоКоэффициента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КСП_ДатаПредоплаты_1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КСП_ДатаПредоплаты_2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаЗапретаЗакупки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаНачалаПродаж</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаЗапретаПродажи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаНачалаЗакупок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КСП_Уровень</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КСП_УровениКоллекций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КСП_Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КСП_Цвета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/КСП/Enums/КСП_УровениКоллекций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>КСП_УровениКоллекций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сезон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Коллекция</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/КСП/Catalogs/КоллекцииНоменклатуры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура КСП_ПриОткрытииПосле(Отказ)
	
	УстановитьВидимостьЭлементовФормыНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КСП_КСП_УровеньПриИзмененииПосле(Элемент)
	
	УстановитьВидимостьЭлементовФормыНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИмяТаблицы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьЭлементовФормыНаКлиенте()
	
	Если Объект.КСП_Уровень = ПредопределенноеЗначение("Перечисление.КСП_УровениКоллекций.Год") Тогда
		
		Элементы.ГруппаДатаНачалаОкончания.Видимость = Ложь;
		Элементы.ГруппаУправлениеКоллекцией.Видимость = Ложь;
		Элементы.ГруппаДополнительныеРеквизиты.Видимость = Ложь;
		Элементы.ГруппаЦветаФирменногоСтиля.Видимость = Ложь;
		
	ИначеЕсли Объект.КСП_Уровень = ПредопределенноеЗначение("Перечисление.КСП_УровениКоллекций.Сезон") Тогда
		
		Элементы.ГруппаДатаНачалаОкончания.Видимость = Ложь;
		Элементы.ГруппаУправлениеКоллекцией.Видимость = Ложь;
		Элементы.ГруппаДополнительныеРеквизиты.Видимость = Ложь;
		Элементы.ГруппаЦветаФирменногоСтиля.Видимость = Ложь;
		
	ИначеЕсли Объект.КСП_Уровень = ПредопределенноеЗначение("Перечисление.КСП_УровениКоллекций.Проект") Тогда
		
		Элементы.ГруппаДатаНачалаОкончания.Видимость = Ложь;
		Элементы.ГруппаУправлениеКоллекцией.Видимость = Ложь;
		Элементы.ГруппаДополнительныеРеквизиты.Видимость = Истина;
		Элементы.ГруппаЦветаФирменногоСтиля.Видимость = Ложь;
		
	ИначеЕсли Объект.КСП_Уровень = ПредопределенноеЗначение("Перечисление.КСП_УровениКоллекций.Коллекция") Тогда
		
		Элементы.ГруппаДатаНачалаОкончания.Видимость = Ложь;
		Элементы.ГруппаУправлениеКоллекцией.Видимость = Ложь;
		Элементы.ГруппаДополнительныеРеквизиты.Видимость = Ложь;
		Элементы.ГруппаЦветаФирменногоСтиля.Видимость = Истина;
		
	Иначе
		
		Элементы.ГруппаДатаНачалаОкончания.Видимость = Ложь;
		Элементы.ГруппаУправлениеКоллекцией.Видимость = Ложь;
		Элементы.ГруппаДополнительныеРеквизиты.Видимость = Ложь;
		Элементы.ГруппаЦветаФирменногоСтиля.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
